
import pandas as pd

def count_sum (df2):
    df3 = pd.DataFrame(
        {
            "Товар": ["Банан","Хлеб"],
            "Количество": [0,0],
        }
    )
    df3.at[1, "Количество"] = df2.at[1, "Количество"] + df2.at[3, "Количество"]
    df3.at[0, "Количество"] = df2.at[0, "Количество"] + df2.at[2, "Количество"]
    print(df3)
    return df3
df2 = pd.DataFrame(
        {
            "Дата": ["07.05.2022","07.05.2022","08.05.2022","08.05.2022"],
            "Товар": ["Банан","Хлеб","Банан","Хлеб"],
            "Количество": [30,10,40,8],
        }
    )

count_sum(df2)